# AnalyticalModelCheckSupportDistance Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
StructuralSettings..::..AnalyticalModelCheckSupportDistance Property
StructuralSettings Class See Also
---
Check that joins in the physical model are consistent with proximity in the analytical model.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool AnalyticalModelCheckSupportDistance { get; set; }
```

Visual Basic
---
```text
Public Property AnalyticalModelCheckSupportDistance As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AnalyticalModelCheckSupportDistance {
	bool get ();
	void set (bool value);
}
```

# Remarks
When this check is enabled, a warning will be given for physically joined members whose analytical curves are more than a certain distance apart. The distance is given by the AnalyticalModelSupportDistanceTolerance property.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace